# chezmoi:template:left-delimiter="# {{" right-delimiter=}}
# {{ $isDarwin := eq .chezmoi.os "darwin" -}}
# {{ $isServer := eq .chezmoi.hostname "box" -}}

# NOTE: Packages outside conditionals install on ALL machines (macOS + VPS).
# Wrap macOS/desktop-only packages in: # {{ if $isDarwin -}} ... # {{ end -}}

# =============================================================================
# CORE TERMINAL ECOSYSTEM
# =============================================================================

# Shells
brew "fish"     # User-friendly command-line shell
brew "nushell"  # Modern shell for the GitHub era
brew "starship" # Cross-shell prompt for astronauts

# Modern CLI replacements
brew "bat"     # Cat clone with syntax highlighting and Git integration
brew "bottom"  # Cross-platform graphical process/system monitor
brew "eza"     # Modern, maintained replacement for ls
brew "fd"      # Simple, fast alternative to find
brew "fzf"     # Command-line fuzzy finder
brew "ripgrep" # Fast grep alternative
brew "tree"    # Display directories as trees
brew "zoxide"  # Smarter cd command with memory

# =============================================================================
# FILE MANAGER (YAZI ECOSYSTEM)
# =============================================================================

brew "yazi" # Blazing fast terminal file manager

# Yazi dependencies for previews
brew "fd"       # File searching
brew "fzf"      # Quick file subtree navigation
brew "jq"       # JSON preview
brew "ripgrep"  # File content searching
brew "sevenzip" # Archive extraction and preview
brew "zoxide"   # Historical directories navigation

# {{ if $isDarwin -}}
# Yazi visual preview dependencies (require GUI terminal)
brew "imagemagick"       # Font, HEIC, JPEG XL preview
brew "poppler"           # PDF preview
brew "resvg"             # SVG preview
brew "ffmpeg"            # Video thumbnails
brew "ffmpegthumbnailer" # Create thumbnails for video files
brew "chafa"             # Unicode/ASCII/ANSI graphics renderer
# {{ end -}}

# =============================================================================
# DEVELOPMENT - LANGUAGES & RUNTIMES
# =============================================================================

# {{ if $isDarwin -}}
# JavaScript/TypeScript
tap "oven-sh/bun"
brew "oven-sh/bun/bun" # Fast JavaScript runtime, bundler, package manager

# Go
brew "golangci-lint" # Fast linters runner for Go
brew "gopls"         # Language server for Go
brew "templ"         # HTML templating language for Go
# {{ end -}}

# Python
brew "uv" # Fast Python package installer and resolver

# Polyglot runtime manager
brew "mise" # Polyglot runtime manager (asdf rust clone)

# =============================================================================
# GIT TOOLS
# =============================================================================

brew "gh"        # GitHub CLI
brew "git-delta" # Syntax-highlighting pager for git/diff output
brew "gitleaks"  # Audit git repos for secrets
brew "lazygit"   # Simple terminal UI for git commands

# =============================================================================
# DEVELOPMENT - TOOLS & FORMATTERS
# =============================================================================

# {{ if $isDarwin -}}
# AI coding assistants
cask "claude"
cask "claude-code"

brew "models"

# Shell scripting
brew "actionlint" # Static checker for GitHub Actions workflow files
brew "shellcheck" # Static analysis for shell scripts
brew "shfmt"      # Autoformat shell script source code

# General formatters
brew "difftastic" # Diff that understands syntax
tap "hougesen/tap"
brew "hougesen/tap/kdlfmt" # Code formatter for KDL documents
brew "superhtml"           # HTML Language Server & Templating Library
brew "topiary"             # Uniform formatter for simple languages

# Linters
brew "tflint" # Linter for Terraform files
# {{ end -}}

# =============================================================================
# CONTAINERS & VIRTUALIZATION
# =============================================================================

brew "colima"         # Container runtimes on macOS with minimal setup
brew "ctop"           # Top-like interface for container metrics
brew "docker"         # Pack, ship and run applications as containers
brew "docker-compose" # Isolated development environments using Docker
brew "docker-buildx"  # Docker CLI plugin for extended build capabilities with BuildKit
brew "lazydocker"     # Lazier way to manage everything Docker
brew "skopeo"         # Work with remote container image registries

# =============================================================================
# DATABASES
# =============================================================================

brew "leveldb"       # Key-value storage library with ordered mapping
brew "mysql"         # Open source relational database
brew "postgresql@18" # Object-relational database system
brew "redis"         # Persistent key-value database

# =============================================================================
# CLOUD & CLI TOOLS
# =============================================================================

# AWS
# brew "awscli" # Official Amazon AWS command-line interface

# SSL/Certs
brew "certbot" # Tool to obtain certs from Let's Encrypt
brew "swaks"   # SMTP command-line test tool

# Google Cloud (cask)

# =============================================================================
# SECURITY & NETWORKING
# =============================================================================

# {{ if $isDarwin -}}
# Network utilities
brew "bandwhich" # Terminal bandwidth utilization tool
brew "gping"     # Ping, but with a graph
brew "rustscan"  # Modern Day Portscanner

# Android tools
brew "scrcpy" # Display and control your Android device
# {{ end -}}

# =============================================================================
# MEDIA & GRAPHICS TOOLS
# =============================================================================

# {{ if $isDarwin -}}
# Image processing
brew "exiftool" # Read and write EXIF metadata
brew "graphviz" # Graph visualization software
brew "optipng"  # PNG file optimizer
brew "pastel"   # Command-line tool to generate/analyze colors
# {{ end -}}

# =============================================================================
# DOCUMENTATION & CONTENT
# =============================================================================

brew "glow"     # Render markdown on the CLI
brew "tealdeer" # Fast tldr implementation in Rust
brew "tokei"    # Count code quickly

# {{ if $isDarwin -}}
brew "typst"          # Markup-based typesetting system
brew "monolith"       # Save complete web pages as single HTML files
brew "spotify_player" # Command driven spotify player
brew "tidy-viewer"    # CLI CSV pretty printer
brew "trafilatura"    # Discovery, extraction for Web text
brew "yt-dlp"         # Feature-rich audio/video downloader
# {{ end -}}

# =============================================================================
# SYSTEM UTILITIES
# =============================================================================

brew "chezmoi"   # Manage your dotfiles across multiple machines
brew "fastfetch" # Like neofetch, but much faster
brew "gdu"       # Disk usage analyzer with console interface
brew "gnupg"     # GNU Privacy Guard (OpenPGP)
brew "hyperfine" # Command-line benchmarking tool
brew "sshs"      # Graphical command-line client for SSH
brew "aichat"    # All-in-one AI-Powered CLI Chat & Copilot
tap "gromgit/brewtils"
brew "gromgit/brewtils/taproom" # TUI for browsing Homebrew taps and formulae

# {{ if $isDarwin -}}
brew "asciinema" # Record and share terminal sessions
brew "batt"      # Control battery charging on Apple Silicon MacBooks
brew "caligula"  # User-friendly TUI for disk imaging
brew "mole"      # Deep clean and optimize your Mac

# Security research
brew "sherlock"  # Hunt down social media accounts by username
brew "slackdump" # Export Slack data without admin privileges

# Basecamp tools
# TODO: Switch back to basecamp/tap once https://github.com/basecamp/fizzy-cli/issues/107 is resolved
tap "robzolkos/fizzy-cli"
brew "fizzy-cli" # Fizzy CLI and Agent Skills
# {{ end -}}

# =============================================================================
# MACOS WINDOW MANAGEMENT & CUSTOMIZATION
# =============================================================================

# {{ if $isDarwin -}}

tap "felixkratz/formulae"
brew "felixkratz/formulae/borders"    # Window border system for macOS
brew "felixkratz/formulae/sketchybar" # Custom macOS statusbar

# Fonts for UI customization
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "sf-symbols"

# Window manager
tap "nikitabobko/tap"
cask "aerospace" # i3-like tiling window manager

# Mouse/Input customization
# cask "linearmouse" # Customize mouse behavior

# =============================================================================
# DEVELOPMENT GUI APPLICATIONS
# =============================================================================

# Database clients
cask "db-browser-for-sqlite"
cask "dbeaver-community" # Universal database tool and SQL client
cask "redis-insight"     # GUI for Redis application development
cask "sequel-ace"        # MySQL/MariaDB database management
cask "tableplus"         # Native GUI tool for relational databases

# Editors
cask "cursor" # AI-powered code editor
cask "zed"    # Multiplayer code editor

# Terminal emulator
cask "ghostty" # Terminal emulator with GPU acceleration
cask "cmux"    # Ghostty-based terminal with vertical tabs for AI coding agents

# Keyboard firmware
cask "qmk-toolbox" # Toolbox companion for QMK Firmware

# =============================================================================
# CLOUD & VPN
# =============================================================================

cask "gcloud-cli" # Set of tools to manage Google Cloud resources
brew "cloud-sql-proxy"
cask "openvpn-connect" # Client program for OpenVPN Access Server
cask "pritunl"         # OpenVPN client
cask "tailscale-app"   # Mesh VPN based on WireGuard
cask "teamviewer"      # Remote access and connectivity software

# =============================================================================
# COMMUNICATION
# =============================================================================

cask "legcord" # Custom Discord client
# cask "rocket"   # Emoji picker
cask "telegram" # Messaging app

cask "whatsapp" # Native desktop client for WhatsApp
cask "zoom"     # Video communication platform

# =============================================================================
# PRODUCTIVITY & NOTES
# =============================================================================

cask "anki" # Memory training application
cask "slack"
cask "craft"    # Native document editor
cask "obsidian" # Knowledge base on Markdown files

# =============================================================================
# MEDIA & ENTERTAINMENT
# =============================================================================

cask "handbrake-app" # Open-source video transcoder
cask "iina"          # Free and open-source media player
cask "spotify"       # Music streaming service
cask "transmission"  # BitTorrent client
# cask "vlc"           # Multimedia player

# =============================================================================
# SYSTEM UTILITIES (GUI)
# =============================================================================

cask "bitwarden" # Desktop password and login vault
brew "bitwarden-cli"
cask "crystalfetch" # UI for creating Windows installer ISO
cask "handy"        # Speech to text application
cask "keycastr"     # Open-source keystroke visualiser
cask "localsend"    # Open-source cross-platform alternative to AirDrop
cask "notunes"      # Prevent iTunes/Apple Music from launching
cask "raycast"      # Control your tools with a few keystrokes

# Remote desktop
cask "rustdesk" # Open source virtual/remote desktop application

# Android
cask "android-commandlinetools" # Command-line tools for Android apps
cask "android-platform-tools"   # Android SDK Platform-Tools
cask "openmtp"                  # Android file transfer

# Virtualization
cask "temurin" # Eclipse Temurin Java Development Kit
# cask "utm"           # Virtual machines UI using QEMU
cask "wireshark-app" # Network protocol analyzer

# {{ end -}}
